OS-Q/A52B/boards.txt
# Copyright (c) 2018 Meteca SA. All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


menu.mcu=Processor
menu.partitions=ESP flash partition
menu.usb=USB port
menu.variant=Variant


# ESP Console port
# ------------------------------------------
mbc_esp.name=Briki MBC-WB - esp
mbc_esp.vid.0=0x3112
mbc_esp.pid.0=0x0001
mbc_esp.descriptor.0=Briki MBC-WB (esp)
mbc_esp.hide=true
mbc_esp.build.board=MBC-WB


# SAMD Console port
# ------------------------------------------
mbc_samd.name=Briki MBC-WB - samd
mbc_samd.vid.0=0x3112
mbc_samd.pid.0=0x0001
mbc_samd.descriptor.0=Briki MBC-WB (samd)
mbc_samd.hide=true
mbc_samd.build.board=MBC-WB



# MBC-WB
# ------------------------------------------

# Common parameters
mbc.name=Briki MBC-WB
mbc.vid.0=0x3112
mbc.pid.0=0x0001
mbc.vid.1=0x3112
mbc.pid.1=0x0002
mbc.build.vid=0x3112
mbc.build.pid=0x0001
mbc.build.board=MBC-WB
mbc.build.core=samd21
mbc.build.usb_product="Briki MBC-WB"
mbc.build.usb_manufacturer="Meteca SA"

# Menu options
mbc.menu.partitions.ffat=FFAT storage (1.5MB)
mbc.menu.partitions.ffat.build.partitions=8MB_ffat
mbc.menu.partitions.spiffs=SPIFFS storage (1.5MB)
mbc.menu.partitions.spiffs.build.partitions=8MB_spiffs

mbc.menu.usb.enabled=Double USB port
mbc.menu.usb.enabled.build.extraCDC=MULTIPLE_CDC
mbc.menu.usb.disabled=Single USB port
mbc.menu.usb.disabled.build.extraCDC=SINGLE_CDC

mbc.menu.variant.default=default
mbc.menu.variant.default.build.var=
mbc.menu.variant.custom=custom
mbc.menu.variant.custom.build.var=-DCUSTOM_VARIANT

#--------------------------------------------------------------------------------------#
#                                SAM D21
#--------------------------------------------------------------------------------------#

mbc.menu.mcu.samd=SAMD21

mbc.menu.mcu.samd.upload.tool=mbctool
mbc.menu.mcu.samd.upload.protocol=sam-ba
mbc.menu.mcu.samd.upload.maximum_size=253952
mbc.menu.mcu.samd.upload.maximum_data_size=32768
mbc.menu.mcu.samd.upload.use_1200bps_touch=false
mbc.menu.mcu.samd.upload.wait_for_upload_port=false
mbc.menu.mcu.samd.upload.native_usb=true
mbc.menu.mcu.samd.upload.target=samd
mbc.menu.mcu.samd.upload.partitions=
mbc.menu.mcu.samd.upload.boot_file=
mbc.menu.mcu.samd.upload.part_file=
mbc.menu.mcu.samd.upload.sketch_offset=
mbc.menu.mcu.samd.upload.network_param=-c

mbc.menu.mcu.samd.build.mcu=cortex-m0plus
mbc.menu.mcu.samd.build.f_cpu=48000000L
mbc.menu.mcu.samd.build.core=samd21
mbc.menu.mcu.samd.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} {build.var}
mbc.menu.mcu.samd.build.sub_arch=SAMD
mbc.menu.mcu.samd.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mbc.menu.mcu.samd.build.openocdscript=openocd_scripts/arduino_zero.cfg
mbc.menu.mcu.samd.build.variant=briki_mbcwb_samd21
mbc.menu.mcu.samd.build.variant_system_lib=
mbc.menu.mcu.samd.build.compiler.path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/
mbc.menu.mcu.samd.build.compiler.c.cmd=arm-none-eabi-gcc
mbc.menu.mcu.samd.build.compiler.c.flags=-mcpu={build.mcu} -mthumb -c -g -Os -w -std=gnu11 -ffunction-sections -fdata-sections -nostdlib --param max-inline-insns-single=500 -MMD -DBRIKI_MBC_WB_SAMD -D{build.extraCDC}
mbc.menu.mcu.samd.build.compiler.c.elf.flags=-Os -Wl,--gc-sections -save-temps
mbc.menu.mcu.samd.build.compiler.S.flags=-c -g -w -x assembler-with-cpp -MMD -DBRIKI_MBC_WB_SAMD
mbc.menu.mcu.samd.build.compiler.cpp.cmd=arm-none-eabi-g++
mbc.menu.mcu.samd.build.compiler.cpp.flags=-mcpu={build.mcu} -mthumb -c -g -Os -w -std=gnu++11 -ffunction-sections -fdata-sections -fno-threadsafe-statics -nostdlib --param max-inline-insns-single=500 -fno-rtti -fno-exceptions -MMD -DBRIKI_MBC_WB_SAMD -D{build.extraCDC}
mbc.menu.mcu.samd.build.compiler.ar.cmd=arm-none-eabi-ar
mbc.menu.mcu.samd.build.compiler.ar.flags=rcs
mbc.menu.mcu.samd.build.compiler.objcopy.cmd=arm-none-eabi-objcopy
mbc.menu.mcu.samd.build.compiler.objcopy.eep.flags=-O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0
mbc.menu.mcu.samd.build.compiler.elf2hex.bin.flags=-O binary
mbc.menu.mcu.samd.build.compiler.elf2hex.hex.flags=-O ihex -R .eeprom
mbc.menu.mcu.samd.build.compiler.elf2hex.cmd=arm-none-eabi-objcopy
mbc.menu.mcu.samd.build.compiler.ldflags=-mcpu={build.mcu} -mthumb -Wl,--cref -Wl,--check-sections -Wl,--gc-sections -Wl,--unresolved-symbols=report-all -Wl,--warn-common -Wl,--warn-section-align
mbc.menu.mcu.samd.build.compiler.size.cmd=arm-none-eabi-size
mbc.menu.mcu.samd.build.compiler.readelf.cmd=arm-none-eabi-readelf
mbc.menu.mcu.samd.build.compiler.arm.cmsis.c.flags="-I{runtime.tools.CMSIS-4.5.0.path}/CMSIS/Include/" "-I{runtime.tools.CMSIS-Atmel-1.2.0.path}/CMSIS/Device/ATMEL/"
mbc.menu.mcu.samd.build.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-4.5.0.path}/CMSIS/Lib/GCC/" -larm_cortexM0l_math

mbc.menu.mcu.samd.build.combine.pattern="{compiler.path}{compiler.c.elf.cmd}"  "-L{build.path}" {compiler.c.elf.flags} {compiler.c.elf.extra_flags} "-T{build.variant.path}/{build.ldscript}" "-Wl,-Map,{build.path}/{build.project_name}.map" --specs=nano.specs --specs=nosys.specs {compiler.ldflags} -o "{build.path}/{build.project_name}.elf" {object_files} -Wl,--start-group {compiler.arm.cmsis.ldflags} -lm "{build.path}/{archive_file}" -Wl,--end-group
mbc.menu.mcu.samd.build.bin.pattern="{compiler.path}{compiler.elf2hex.cmd}" {compiler.elf2hex.bin.flags} {compiler.elf2hex.extra_flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbc.menu.mcu.samd.build.hex.pattern="{compiler.path}{compiler.elf2hex.cmd}" {compiler.elf2hex.hex.flags} {compiler.elf2hex.extra_flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbc.menu.mcu.samd.build.hex.pattern.linux="{compiler.path}{compiler.elf2hex.cmd}" {compiler.elf2hex.hex.flags} {compiler.elf2hex.extra_flags} "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbc.menu.mcu.samd.recipe.size.regex=\.text\s+([0-9]+).*
mbc.menu.mcu.samd.recipe.size.regex.data=^(?:\.data|\.rodata|\.bss)\s+([0-9]+).*

mbc.menu.mcu.samd.bootloader.tool=openocd
mbc.menu.mcu.samd.bootloader.file=briki_mbc-wb/samd21_sam_ba.hex

#--------------------------------------------------------------------------------------#
#                                ESP 32
#--------------------------------------------------------------------------------------#

