OS-Q/A52B/boards.txt
mbc.menu.mcu.esp=ESP32

mbc.menu.mcu.esp.upload.tool=mbctool
mbc.menu.mcu.esp.upload.maximum_size=3407872
mbc.menu.mcu.esp.upload.maximum_data_size=327680
mbc.menu.mcu.esp.upload.wait_for_upload_port=true
mbc.menu.mcu.esp.upload.target=esp
mbc.menu.mcu.esp.upload.partitions=0xe000 {runtime.platform.path}/tools/partitions/boot_app0.bin
mbc.menu.mcu.esp.upload.boot_file=0x1000 {runtime.platform.path}/tools/sdk/bin/bootloader_qio_80m.bin
mbc.menu.mcu.esp.upload.part_file=0x8000 {build.path}/{build.project_name}.partitions.bin
mbc.menu.mcu.esp.upload.sketch_offset=0x10000
mbc.menu.mcu.esp.upload.network_param=

mbc.menu.mcu.esp.build.mcu=esp32
mbc.menu.mcu.esp.build.core=esp32
mbc.menu.mcu.esp.build.variant=briki_mbcwb_esp32
mbc.menu.mcu.esp.build.sub_arch=ESP32
mbc.menu.mcu.esp.build.f_cpu=240000000L
mbc.menu.mcu.esp.build.flash_size=8MB
mbc.menu.mcu.esp.build.flash_freq=80m
mbc.menu.mcu.esp.build.flash_mode=dio
mbc.menu.mcu.esp.build.boot=dio
mbc.menu.mcu.esp.build.defines=
mbc.menu.mcu.esp.build.flash_mode=dio
mbc.menu.mcu.esp.build.code_debug=0
mbc.menu.mcu.esp.build.extra_flags=-DESP32 -DCORE_DEBUG_LEVEL={build.code_debug} {build.defines} {build.var}
mbc.menu.mcu.esp.build.compiler.path={runtime.tools.xtensa-esp32-elf-gcc.path}/bin/
mbc.menu.mcu.esp.build.compiler.sdk.path={runtime.platform.path}/tools/sdk
mbc.menu.mcu.esp.build.compiler.c.cmd=xtensa-esp32-elf-gcc
mbc.menu.mcu.esp.build.compiler.cpreprocessor.flags=-DESP_PLATFORM -DMBEDTLS_CONFIG_FILE="mbedtls/esp_config.h" -DHAVE_CONFIG_H "-I{build.compiler.sdk.path}/include/config" "-I{build.compiler.sdk.path}/include/app_trace" "-I{build.compiler.sdk.path}/include/app_update" "-I{build.compiler.sdk.path}/include/asio" "-I{build.compiler.sdk.path}/include/bootloader_support" "-I{build.compiler.sdk.path}/include/bt" "-I{build.compiler.sdk.path}/include/coap" "-I{build.compiler.sdk.path}/include/console" "-I{build.compiler.sdk.path}/include/driver" "-I{build.compiler.sdk.path}/include/esp-tls" "-I{build.compiler.sdk.path}/include/esp32" "-I{build.compiler.sdk.path}/include/esp_adc_cal" "-I{build.compiler.sdk.path}/include/esp_event" "-I{build.compiler.sdk.path}/include/esp_http_client" "-I{build.compiler.sdk.path}/include/esp_http_server" "-I{build.compiler.sdk.path}/include/esp_https_ota" "-I{build.compiler.sdk.path}/include/esp_ringbuf" "-I{build.compiler.sdk.path}/include/ethernet" "-I{build.compiler.sdk.path}/include/expat" "-I{build.compiler.sdk.path}/include/fatfs" "-I{build.compiler.sdk.path}/include/freemodbus" "-I{build.compiler.sdk.path}/include/freertos" "-I{build.compiler.sdk.path}/include/heap" "-I{build.compiler.sdk.path}/include/idf_test" "-I{build.compiler.sdk.path}/include/jsmn" "-I{build.compiler.sdk.path}/include/json" "-I{build.compiler.sdk.path}/include/libsodium" "-I{build.compiler.sdk.path}/include/log" "-I{build.compiler.sdk.path}/include/lwip" "-I{build.compiler.sdk.path}/include/mbedtls" "-I{build.compiler.sdk.path}/include/mdns" "-I{build.compiler.sdk.path}/include/micro-ecc" "-I{build.compiler.sdk.path}/include/mqtt" "-I{build.compiler.sdk.path}/include/newlib" "-I{build.compiler.sdk.path}/include/nghttp" "-I{build.compiler.sdk.path}/include/nvs_flash" "-I{build.compiler.sdk.path}/include/openssl" "-I{build.compiler.sdk.path}/include/protobuf-c" "-I{build.compiler.sdk.path}/include/protocomm" "-I{build.compiler.sdk.path}/include/pthread" "-I{build.compiler.sdk.path}/include/sdmmc" "-I{build.compiler.sdk.path}/include/smartconfig_ack" "-I{build.compiler.sdk.path}/include/soc" "-I{build.compiler.sdk.path}/include/spi_flash" "-I{build.compiler.sdk.path}/include/spiffs" "-I{build.compiler.sdk.path}/include/tcp_transport" "-I{build.compiler.sdk.path}/include/tcpip_adapter" "-I{build.compiler.sdk.path}/include/ulp" "-I{build.compiler.sdk.path}/include/vfs" "-I{build.compiler.sdk.path}/include/wear_levelling" "-I{build.compiler.sdk.path}/include/wifi_provisioning" "-I{build.compiler.sdk.path}/include/wpa_supplicant" "-I{build.compiler.sdk.path}/include/xtensa-debug-module" "-I{build.compiler.sdk.path}/include/esp32-camera" "-I{build.compiler.sdk.path}/include/esp-face" "-I{build.compiler.sdk.path}/include/fb_gfx"
mbc.menu.mcu.esp.build.compiler.c.flags=-std=gnu99 -Os -g3 -fstack-protector -ffunction-sections -fdata-sections -fstrict-volatile-bitfields -mlongcalls -nostdlib -w -Wpointer-arith -Wno-error=unused-function -Wno-error=unused-but-set-variable -Wno-error=unused-variable -Wno-error=deprecated-declarations -Wno-unused-parameter -Wno-sign-compare -Wno-old-style-declaration -MMD -c {build.compiler.cpreprocessor.flags} -DBRIKI_MBC_WB_ESP -D{build.extraCDC}
mbc.menu.mcu.esp.build.compiler.cpp.cmd=xtensa-esp32-elf-g++
mbc.menu.mcu.esp.build.compiler.cpp.flags=-std=gnu++11 -fno-exceptions -Os -g3 -Wpointer-arith -fexceptions -fstack-protector -ffunction-sections -fdata-sections -fstrict-volatile-bitfields -mlongcalls -nostdlib -w -Wno-error=unused-function -Wno-error=unused-but-set-variable -Wno-error=unused-variable -Wno-error=deprecated-declarations -Wno-unused-parameter -Wno-sign-compare -fno-rtti -MMD -c {build.compiler.cpreprocessor.flags} -DBRIKI_MBC_WB_ESP -D{build.extraCDC}
mbc.menu.mcu.esp.build.compiler.S.flags=-c -g3 -w -x assembler-with-cpp -MMD -mlongcalls {build.compiler.cpreprocessor.flags} -DBRIKI_MBC_WB_ESP
mbc.menu.mcu.esp.build.compiler.c.elf.flags=-nostdlib "-L{build.compiler.sdk.path}/lib" "-L{build.compiler.sdk.path}/ld" -T esp32_out.ld -T esp32.common.ld -T esp32.rom.ld -T esp32.peripherals.ld -T esp32.rom.spiram_incompatible_fns.ld -u ld_include_panic_highint_hdl -u call_user_start_cpu0 -Wl,--gc-sections -Wl,-static -Wl,--undefined=uxTopUsedPriority  -u __cxa_guard_dummy -u __cxx_fatal_exception
mbc.menu.mcu.esp.build.compiler.c.elf.libs=-lgcc -lopenssl -lbtdm_app -lfatfs -lwps -lcoexist -lwear_levelling -lesp_http_client -lprotobuf-c -lhal -lnewlib -ldriver -lbootloader_support -lpp -lfreemodbus -lmesh -lsmartconfig -ljsmn -lwpa -lethernet -lphy -lapp_trace -lconsole -lulp -lwpa_supplicant -lfreertos -lbt -lmicro-ecc -lesp32-camera -lcxx -lxtensa-debug-module -ltcp_transport -lmdns -lvfs -lesp_ringbuf -lsoc -lcore -lfb_gfx -lsdmmc -llibsodium -lcoap -ltcpip_adapter -lprotocomm -lesp_event -limage_util -lc_nano -lesp-tls -lasio -lrtc -lspi_flash -lwpa2 -lwifi_provisioning -lesp32 -lface_recognition -lapp_update -lnghttp -lspiffs -lface_detection -lespnow -lnvs_flash -lesp_adc_cal -llog -ldl_lib -lsmartconfig_ack -lexpat -lm -lfr -lmqtt -lc -lheap -lmbedtls -llwip -lnet80211 -lesp_http_server -lpthread -ljson -lesp_https_ota -lfd -lstdc++
mbc.menu.mcu.esp.build.compiler.as.cmd=xtensa-esp32-elf-as
mbc.menu.mcu.esp.build.compiler.ar.cmd=xtensa-esp32-elf-ar
mbc.menu.mcu.esp.build.compiler.ar.flags=cru
mbc.menu.mcu.esp.build.compiler.size.cmd=xtensa-esp32-elf-size
mbc.menu.mcu.esp.build.compiler.arm.cmsis.c.flags=
mbc.menu.mcu.esp.build.compiler.arm.cmsis.ldflags=

mbc.menu.mcu.esp.build.combine.pattern="{compiler.path}{compiler.c.elf.cmd}" {compiler.c.elf.flags} {compiler.c.elf.extra_flags} -Wl,--start-group {object_files} "{build.path}/{archive_file}" {build.compiler.c.elf.libs} -Wl,--end-group -Wl,-EL -o "{build.path}/{build.project_name}.elf"
mbc.menu.mcu.esp.build.bin.pattern={tools.gen_esp32part.cmd} -q "{runtime.platform.path}/tools/partitions/{build.partitions}.csv" "{build.path}/{build.project_name}.partitions.bin"
mbc.menu.mcu.esp.build.hex.pattern="{tools.esptool.path}/{tools.esptool.cmd}" --chip esp32 elf2image --flash_mode "{build.flash_mode}" --flash_freq "{build.flash_freq}" --flash_size "{build.flash_size}" -o "{build.path}/{build.project_name}.bin" "{build.path}/{build.project_name}.elf"
mbc.menu.mcu.esp.recipe.size.regex=^(?:\.iram0\.text|\.iram0\.vectors|\.dram0\.data|\.flash\.text|\.flash\.rodata|)\s+([0-9]+).*
mbc.menu.mcu.esp.recipe.size.regex.data=^(?:\.dram0\.data|\.dram0\.bss|\.noinit)\s+([0-9]+).*


# ABC


